path1 = 'mass/data/88.3.txt'  # путь до первого файла

fil = open(path1, 'r')
mass = fil.readlines()
ful = [int(a[:-1]) for a in mass[:-1]]
ful.append(int(mass[-1]))

a  = ful.index(15)
b = ful.index(45)

mass = len(ful[a+1: b])

for  i in range(len(ful)):
    if ful[i] < 100:
        ful[i] = mass
print(mass)
print(ful)


# 7 [7, 200, 7, 137, 7, 147, 172, 7, 7, 7, 153, 145, 7, 124, 195, 175, 192, 7, 7, 7, 115]
# 20 [145, 20, 123, 20, 182, 20, 131, 20, 20, 113, 20, 193, 20, 291, 191, 281, 20, 205, 20, 217, 291, 183, 20, 20, 228, 150, 150, 137, 229, 20, 203, 279, 258, 20, 220, 20, 279]
# 1 [1, 114, 1, 1, 110, 1, 146, 1, 136, 1, 1, 1, 124, 141, 115, 140, 129, 1, 141, 1, 140, 1, 1, 1, 1, 132]
# правильно 
